nxp-mcuxpresso/mcux-devices-mcx/MCXA/MCXA166/iar/startup_MCXA166.s
; -------------------------------------------------------------------------
;  @file:    startup_MCXA166.s
;  @purpose: CMSIS Cortex-M33 Core Device Startup File
;            MCXA166
;  @version: 1.0
;  @date:    2024-3-26
;  @build:   b241120
; -------------------------------------------------------------------------
;
; Copyright 1997-2016 Freescale Semiconductor, Inc.
; Copyright 2016-2024 NXP
; SPDX-License-Identifier: BSD-3-Clause
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; The vector table is normally located at address 0.
; When debugging in RAM, it can be located in RAM, aligned to at least 2^6.
; The name "__vector_table" has special meaning for C-SPY:
; it is where the SP start value is found, and the NVIC vector
; table register (VTOR) is initialized to this address if != 0.
;
; Cortex-M version
;

        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table
        PUBLIC  __vector_table_0x1c
        PUBLIC  __Vectors
        PUBLIC  __Vectors_End
        PUBLIC  __Vectors_Size

        DATA

__iar_init$$done:              ; The vector table is not needed
                      ; until after copy initialization is done

__vector_table
        DCD     sfe(CSTACK)
        DCD     Reset_Handler

        DCD     NMI_Handler                                   ;NMI Handler
        DCD     HardFault_Handler                             ;Hard Fault Handler
        DCD     MemManage_Handler                             ;MPU Fault Handler
        DCD     BusFault_Handler                              ;Bus Fault Handler
        DCD     UsageFault_Handler                            ;Usage Fault Handler
__vector_table_0x1c
        DCD     SecureFault_Handler                           ;Secure Fault Handler
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     SVC_Handler                                   ;SVCall Handler
        DCD     DebugMon_Handler                              ;Debug Monitor Handler
        DCD     0                                             ;Reserved
        DCD     PendSV_Handler                                ;PendSV Handler
        DCD     SysTick_Handler                               ;SysTick Handler

                                                              ;External Interrupts
        DCD     Reserved16_IRQHandler                         ;OR IRQ1 to IRQ53
        DCD     CMC_IRQHandler                                ;Core Mode Controller interrupt
        DCD     DMA_CH0_IRQHandler                            ;DMA3_0_CH0 error or transfer complete
        DCD     DMA_CH1_IRQHandler                            ;DMA3_0_CH1 error or transfer complete
        DCD     DMA_CH2_IRQHandler                            ;DMA3_0_CH2 error or transfer complete
        DCD     DMA_CH3_IRQHandler                            ;DMA3_0_CH3 error or transfer complete
        DCD     DMA_CH4_IRQHandler                            ;DMA3_0_CH4 error or transfer complete
        DCD     DMA_CH5_IRQHandler                            ;DMA3_0_CH5 error or transfer complete
        DCD     DMA_CH6_IRQHandler                            ;DMA3_0_CH6 error or transfer complete
        DCD     DMA_CH7_IRQHandler                            ;DMA3_0_CH7 error or transfer complete
        DCD     ERM0_SINGLE_BIT_IRQHandler                    ;ERM Single Bit error interrupt
        DCD     ERM0_MULTI_BIT_IRQHandler                     ;ERM Multi Bit error interrupt
        DCD     FMU0_IRQHandler                               ;Flash Management Unit interrupt
        DCD     GLIKEY0_IRQHandler                            ;GLIKEY Interrupt
        DCD     MBC0_IRQHandler                               ;MBC secure violation interrupt
        DCD     SCG0_IRQHandler                               ;System Clock Generator interrupt
        DCD     SPC0_IRQHandler                               ;System Power Controller interrupt
        DCD     TDET_IRQHandler                               ;TDET interrrupt
        DCD     WUU0_IRQHandler                               ;Wake Up Unit interrupt
        DCD     CAN0_IRQHandler                               ;Controller Area Network 0 interrupt
        DCD     CAN1_IRQHandler                               ;Controller Area Network 1 interrupt
        DCD     Reserved37_IRQHandler                         ;xxx Interrupt 37
        DCD     Reserved38_IRQHandler                         ;xxx Interrupt 38
        DCD     FLEXIO_IRQHandler                             ;Flexible Input/Output interrupt
        DCD     I3C0_IRQHandler                               ;Improved Inter Integrated Circuit interrupt 0
        DCD     Reserved41_IRQHandler                         ;xxx Interrupt 41
        DCD     LPI2C0_IRQHandler                             ;Low-Power Inter Integrated Circuit 0 interrupt
        DCD     LPI2C1_IRQHandler                             ;Low-Power Inter Integrated Circuit 1 interrupt
        DCD     LPSPI0_IRQHandler                             ;Low-Power Serial Peripheral Interface 0 interrupt
        DCD     LPSPI1_IRQHandler                             ;Low-Power Serial Peripheral Interface 1 interrupt
        DCD     Reserved46_IRQHandler                         ;xxx Interrupt 46
        DCD     LPUART0_IRQHandler                            ;Low-Power Universal Asynchronous Receive/Transmit 0 interrupt
        DCD     LPUART1_IRQHandler                            ;Low-Power Universal Asynchronous Receive/Transmit 1 interrupt
        DCD     LPUART2_IRQHandler                            ;Low-Power Universal Asynchronous Receive/Transmit 2 interrupt
        DCD     LPUART3_IRQHandler                            ;Low-Power Universal Asynchronous Receive/Transmit 3 interrupt
        DCD     LPUART4_IRQHandler                            ;Low-Power Universal Asynchronous Receive/Transmit 4 interrupt
        DCD     USB0_IRQHandler                               ;Universal Serial Bus - Full Speed interrupt
        DCD     Reserved53_IRQHandler                         ;xxx Interrupt 53
        DCD     CDOG0_IRQHandler                              ;Code Watchdog Timer 0 interrupt
        DCD     CTIMER0_IRQHandler                            ;Standard counter/timer 0 interrupt
        DCD     CTIMER1_IRQHandler                            ;Standard counter/timer 1 interrupt
        DCD     CTIMER2_IRQHandler                            ;Standard counter/timer 2 interrupt
        DCD     CTIMER3_IRQHandler                            ;Standard counter/timer 3 interrupt
        DCD     CTIMER4_IRQHandler                            ;Standard counter/timer 4 interrupt
        DCD     FLEXPWM0_RELOAD_ERROR_IRQHandler              ;FlexPWM0_reload_error interrupt
        DCD     FLEXPWM0_FAULT_IRQHandler                     ;FlexPWM0_fault interrupt
        DCD     FLEXPWM0_SUBMODULE0_IRQHandler                ;FlexPWM0 Submodule 0 capture/compare/reload interrupt
        DCD     FLEXPWM0_SUBMODULE1_IRQHandler                ;FlexPWM0 Submodule 1 capture/compare/reload interrupt
        DCD     FLEXPWM0_SUBMODULE2_IRQHandler                ;FlexPWM0 Submodule 2 capture/compare/reload interrupt
        DCD     FLEXPWM0_SUBMODULE3_IRQHandler                ;FlexPWM0 Submodule 3 capture/compare/reload interrupt
        DCD     EQDC0_COMPARE_IRQHandler                      ;Compare
        DCD     EQDC0_HOME_IRQHandler                         ;Home
        DCD     EQDC0_WATCHDOG_IRQHandler                     ;Watchdog / Simultaneous A and B Change
        DCD     EQDC0_INDEX_IRQHandler                        ;Index / Roll Over / Roll Under
        DCD     FREQME0_IRQHandler                            ;Frequency Measurement interrupt
        DCD     LPTMR0_IRQHandler                             ;Low Power Timer 0 interrupt
        DCD     Reserved72_IRQHandler                         ;xxx Interrupt 72
        DCD     OS_EVENT_IRQHandler                           ;OS event timer interrupt
        DCD     WAKETIMER0_IRQHandler                         ;Wake Timer Interrupt
        DCD     UTICK0_IRQHandler                             ;Micro-Tick Timer interrupt
        DCD     WWDT0_IRQHandler                              ;Windowed Watchdog Timer 0 interrupt
        DCD     Reserved77_IRQHandler                         ;xxx Interrupt 77
        DCD     ADC0_IRQHandler                               ;Analog-to-Digital Converter 0 interrupt
        DCD     ADC1_IRQHandler                               ;Analog-to-Digital Converter 1 interrupt
        DCD     CMP0_IRQHandler                               ;Comparator 0 interrupt
        DCD     CMP1_IRQHandler                               ;Comparator 1 interrupt
        DCD     CMP2_IRQHandler                               ;Comparator 2 interrupt
        DCD     DAC0_IRQHandler                               ;Digital-to-Analog Converter 0 - General Purpose interrupt
        DCD     Reserved84_IRQHandler                         ;xxx Interrupt 84
        DCD     Reserved85_IRQHandler                         ;xxx Interrupt 85
        DCD     Reserved86_IRQHandler                         ;xxx Interrupt 86
        DCD     GPIO0_IRQHandler                              ;General Purpose Input/Output interrupt 0
        DCD     GPIO1_IRQHandler                              ;General Purpose Input/Output interrupt 1
        DCD     GPIO2_IRQHandler                              ;General Purpose Input/Output interrupt 2
        DCD     GPIO3_IRQHandler                              ;General Purpose Input/Output interrupt 3
        DCD     GPIO4_IRQHandler                              ;General Purpose Input/Output interrupt 4
        DCD     Reserved92_IRQHandler                         ;xxx Interrupt 92
        DCD     LPI2C2_IRQHandler                             ;Low-Power Inter Integrated Circuit 2 interrupt
        DCD     LPI2C3_IRQHandler                             ;Low-Power Inter Integrated Circuit 3 interrupt
        DCD     FLEXPWM1_RELOAD_ERROR_IRQHandler              ;FlexPWM1_reload_error interrupt
        DCD     FLEXPWM1_FAULT_IRQHandler                     ;FlexPWM1_fault interrupt
        DCD     FLEXPWM1_SUBMODULE0_IRQHandler                ;FlexPWM1 Submodule 0 capture/compare/reload interrupt
        DCD     FLEXPWM1_SUBMODULE1_IRQHandler                ;FlexPWM1 Submodule 1 capture/compare/reload interrupt
        DCD     FLEXPWM1_SUBMODULE2_IRQHandler                ;FlexPWM1 Submodule 2 capture/compare/reload interrupt
        DCD     FLEXPWM1_SUBMODULE3_IRQHandler                ;FlexPWM1 Submodule 3 capture/compare/reload interrupt
        DCD     EQDC1_COMPARE_IRQHandler                      ;Compare
        DCD     EQDC1_HOME_IRQHandler                         ;Home
        DCD     EQDC1_WATCHDOG_IRQHandler                     ;Watchdog / Simultaneous A and B Change
        DCD     EQDC1_INDEX_IRQHandler                        ;Index / Roll Over / Roll Under
        DCD     Reserved105_IRQHandler                        ;xxx Interrupt 105
        DCD     Reserved106_IRQHandler                        ;xxx Interrupt 106
        DCD     Reserved107_IRQHandler                        ;xxx Interrupt 107
        DCD     Reserved108_IRQHandler                        ;xxx Interrupt 108
        DCD     Reserved109_IRQHandler                        ;xxx Interrupt 109
        DCD     Reserved110_IRQHandler                        ;xxx Interrupt 110
        DCD     LPUART5_IRQHandler                            ;Low-Power Universal Asynchronous Receive/Transmit interrupt
        DCD     Reserved112_IRQHandler                        ;xxx Interrupt 112
        DCD     Reserved113_IRQHandler                        ;xxx Interrupt 113
        DCD     Reserved114_IRQHandler                        ;xxx Interrupt 114
        DCD     Reserved115_IRQHandler                        ;xxx Interrupt 115
        DCD     Reserved116_IRQHandler                        ;xxx Interrupt 116
        DCD     Reserved117_IRQHandler                        ;xxx Interrupt 117
        DCD     Reserved118_IRQHandler                        ;xxx Interrupt 118
        DCD     Reserved119_IRQHandler                        ;xxx Interrupt 119
        DCD     Reserved120_IRQHandler                        ;xxx Interrupt 120
        DCD     Reserved121_IRQHandler                        ;xxx Interrupt 121
        DCD     Reserved122_IRQHandler                        ;xxx Interrupt 122
        DCD     MAU_IRQHandler                                ;MAU interrupt
        DCD     SMARTDMA_IRQHandler                           ;SmartDMA interrupt
        DCD     CDOG1_IRQHandler                              ;Code Watchdog Timer 1 interrupt
        DCD     PKC_IRQHandler                                ;PKC interrupt
        DCD     SGI_IRQHandler                                ;SGI interrupt
        DCD     Reserved128_IRQHandler                        ;xxx Interrupt 128
        DCD     TRNG0_IRQHandler                              ;True Random Number Generator interrupt
        DCD     Reserved130_IRQHandler                        ;xxx Interrupt 130
        DCD     Reserved131_IRQHandler                        ;xxx Interrupt 131
        DCD     ADC2_IRQHandler                               ;Analog-to-Digital Converter 2 interrupt
        DCD     ADC3_IRQHandler                               ;Analog-to-Digital Converter 3 interrupt
        DCD     Reserved134_IRQHandler                        ;xxx Interrupt 134
        DCD     RTC_IRQHandler                                ;RTC alarm interrupt
        DCD     RTC_1HZ_IRQHandler                            ;RTC 1Hz interrupt
        DCD     SLCD_IRQHandler                               ;SLCD frame start interrupt
__Vectors_End

__Vectors       EQU   __vector_table
__Vectors_Size  EQU   __Vectors_End - __Vectors


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; Default interrupt handlers.
;;
        THUMB

        PUBWEAK Reset_Handler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler
        CPSID   I               ; Mask interrupts
        LDR     R0, =0xE000ED08
        LDR     R1, =__vector_table
        STR     R1, [R0]
        LDR     R2, [R1]
        MSR     MSP, R2
        LDR     R0, =sfb(CSTACK)
        MSR     MSPLIM, R0
        CPSIE   I               ; Unmask interrupts
        LDR     R0, =SystemInit
        BLX     R0
        LDR     R0, =__iar_program_start
        BX      R0

        PUBWEAK NMI_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
        B .

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
        B .

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
        B .

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
        B .

